billboardcat/ece477-freshbyte/ece477-nucleo-integration/ece477-nucleo-integration.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L0
ProjectManager.MainLocation=Core/Src
PA6.Mode=Full_Duplex_Master
PC7.GPIOParameters=GPIO_Speed,GPIO_Label
RCC.USART1Freq_Value=32000000
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L053R8Tx
Dma.ADC.0.Mode=DMA_CIRCULAR
SPI1.VirtualType=VM_MASTER
NVIC.TIM6_DAC_IRQn=true\:2\:0\:true\:true\:true\:1\:true\:true
RCC.PLLCLKFreq_Value=32000000
PC7.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_I2C1_Init-I2C1-false-HAL-true,5-MX_USART2_UART_Init-USART2-false-HAL-true,6-MX_TIM6_Init-TIM6-false-HAL-true,7-MX_SPI1_Init-SPI1-false-HAL-true,8-MX_ADC_Init-ADC-false-HAL-true,9-MX_TIM2_Init-TIM2-false-HAL-true,10-MX_USART1_UART_Init-USART1-false-HAL-true
Dma.ADC.0.Priority=DMA_PRIORITY_LOW
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
RTC.WeekDay=RTC_WEEKDAY_SATURDAY
RCC.RTCFreq_Value=37000
PC9.Locked=true
PB6.GPIO_Label=EPD_CS
RCC.USART2Freq_Value=32000000
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
USART1.IPParameters=VirtualMode-Asynchronous
RCC.48CLKFreq_Value=32000000
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
SH.GPXTI2.0=GPIO_EXTI2
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=32000000
PB2.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
Mcu.IP5=RTC
Mcu.IP2=I2C1
I2C1.IPParameters=Timing
Mcu.IP3=NVIC
PB4.GPIOParameters=GPIO_Label
Mcu.IP0=ADC
Mcu.IP1=DMA
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
Dma.ADC.0.PeriphInc=DMA_PINC_DISABLE
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=32000000
Mcu.IPNb=12
TIM2.IPParameters=Prescaler,Period
ProjectManager.PreviousToolchain=STM32CubeIDE
RCC.APB2TimFreq_Value=32000000
PB6.Signal=GPIO_Output
PC7.Signal=GPIO_Output
RTC.IPParameters=Hours,Minutes,HourFormat,TimeFormat,Month,Year,WeekDay
SPI1.CalculateBaudRate=16.0 MBits/s
Mcu.Pin6=PA7
Mcu.Pin7=PB0
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PB2
Mcu.Pin9=PC7
Dma.USART1_RX.1.MemInc=DMA_MINC_ENABLE
RCC.AHBFreq_Value=32000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
Dma.ADC.0.Direction=DMA_PERIPH_TO_MEMORY
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA2
Mcu.Pin3=PA3
Mcu.Pin4=PA5
ADC.SamplingTime=ADC_SAMPLETIME_160CYCLES_5
Mcu.Pin5=PA6
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
RTC.Minutes=30
Dma.USART1_RX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB2.Signal=GPXTI2
PA8.Locked=true
Mcu.IP10=USART1
USART2.VirtualMode-Asynchronous=VM_ASYNC
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLLMUL_4
Mcu.IP11=USART2
ProjectManager.FirmwarePackage=STM32Cube FW_L0 V1.12.0
MxDb.Version=DB.6.0.21
RTC.Month=RTC_MONTH_MAY
ProjectManager.BackupPrevious=false
NVIC.TIM2_IRQn=true\:0\:0\:false\:true\:true\:2\:true\:true
File.Version=6
PA0.Mode=IN0
PB8.Locked=true
PA8.Signal=GPIO_Output
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM6.Period=60000-1
Dma.RequestsNb=2
PB6.GPIOParameters=GPIO_Speed,GPIO_Label
ProjectManager.HalAssertFull=false
PB0.Locked=true
PB2.GPIO_PuPd=GPIO_PULLDOWN
ProjectManager.ProjectName=ece477-nucleo-integration
PA0.Signal=ADC_IN0
Dma.ADC.0.MemInc=DMA_MINC_ENABLE
Dma.USART1_RX.1.Mode=DMA_NORMAL
PC8.GPIOParameters=GPIO_Label
PB9.Signal=I2C1_SDA
Mcu.Package=LQFP64
TIM2.Prescaler=4000 - 1
PA6.Signal=SPI1_MISO
PA0.GPIO_PuPd=GPIO_NOPULL
ProjectManager.ToolChainLocation=
Dma.ADC.0.Instance=DMA1_Channel1
RCC.LSI_VALUE=37000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
PA5.GPIOParameters=GPIO_Speed
Dma.USART1_RX.1.PeriphInc=DMA_PINC_DISABLE
Dma.ADC.0.MemDataAlignment=DMA_MDATAALIGN_WORD
PB5.GPIO_Label=RED_LED
Dma.Request1=USART1_RX
RCC.APB1TimFreq_Value=32000000
Dma.USART1_RX.1.Priority=DMA_PRIORITY_LOW
PA6.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
Dma.Request0=ADC
ProjectManager.CustomerFirmwarePackage=
RCC.HSI48_VALUE=48000000
RCC.LPTIMFreq_Value=32000000
PB4.Signal=GPIO_Output
PA3.Signal=USART2_RX
PA5.Mode=Full_Duplex_Master
RCC.TIMFreq_Value=32000000
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
PA6.GPIOParameters=GPIO_Speed
RCC.MSI_VALUE=2097000
Dma.USART1_RX.1.Instance=DMA1_Channel3
ProjectManager.ProjectFileName=ece477-nucleo-integration.ioc
Dma.USART1_RX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
PA7.Mode=Full_Duplex_Master
RCC.48USBFreq_Value=32000000
Mcu.PinsNb=25
PA10.Mode=Asynchronous
PC9.GPIO_Label=SRAM_CS
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
RCC.LPUARTFreq_Value=32000000
PC8.Signal=GPIO_Output
TIM6.Prescaler=2097-1
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
ProjectManager.DefaultFWLocation=true
ADC.LowPowerAutoWait=DISABLE
ADC.IPParameters=EnableAnalogWatchDog,ContinuousConvMode,LowPowerAutoWait,SamplingTime,DMAContinuousRequests,WatchdogChannel,HighThreshold,ITMode,ClockPrescaler
ProjectManager.DeletePrevious=true
RCC.TimerFreq_Value=32000000
ADC.ClockPrescaler=ADC_CLOCK_ASYNC_DIV64
USART2.BaudRate=9600
RCC.FamilyName=M
Dma.ADC.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
RCC.WatchDogFreq_Value=37000
ADC.EnableAnalogWatchDog=true
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PC8.GPIO_Label=EN_5V
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA3.Mode=Asynchronous
RCC.HSI16_VALUE=16000000
PA9.Mode=Asynchronous
TIM6.IPParameters=Prescaler,Period
SH.GPXTI2.ConfNb=1
RTC.TimeFormat=RTC_HOURFORMAT12_PM
ProjectManager.TargetToolchain=STM32CubeIDE
Dma.USART1_RX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
RTC.Year=21
PB9.Mode=I2C
PB2.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PA9.Signal=USART1_TX
I2C1.Timing=0x00707CBB
PB5.Locked=true
PB9.Locked=true
ProjectManager.RegisterCallBack=
RCC.LSE_VALUE=32768
PA1.Signal=ADC_IN1
PA5.Signal=SPI1_SCK
ADC.DMAContinuousRequests=ENABLE
RCC.MCOPinFreq_Value=32000000
PB0.Mode=IN8
board=custom
PC7.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
RCC.VCOOutputFreq_Value=64000000
ProjectManager.LastFirmware=true
PA7.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
NVIC.EXTI2_3_IRQn=true\:1\:0\:true\:false\:true\:true\:true
Dma.ADC.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
RCC.APB2Freq_Value=32000000
PA1.Mode=IN1
MxCube.Version=6.2.1
PB4.GPIO_Label=GREEN_LED
VP_TIM2_VS_ClockSourceINT.Mode=Internal
RCC.I2C1Freq_Value=32000000
SPI1.Mode=SPI_MODE_MASTER
RCC.LCDFreq_Value=37000
VP_SYS_VS_Systick.Mode=SysTick
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TIM2.Period=100
ProjectManager.FreePins=false
RCC.IPParameters=48CLKFreq_Value,48RNGFreq_Value,48USBFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI16_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,LCDFreq_Value,LPTIMFreq_Value,LPUARTFreq_Value,LSE_VALUE,LSI_VALUE,MCOPinFreq_Value,MSI_VALUE,PLLCLKFreq_Value,PLLMUL,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOOutputFreq_Value,WatchDogFreq_Value
PC9.GPIOParameters=GPIO_Label
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L053R(6-8)Tx
RCC.RTCHSEDivFreq_Value=4000000
PA2.Signal=USART2_TX
Mcu.Pin24=VP_TIM6_VS_ClockSourceINT
ProjectManager.UnderRoot=true
PB2.Locked=true
Mcu.IP8=TIM2
Mcu.IP9=TIM6
PC7.GPIO_Label=EPD_DC
Mcu.IP6=SPI1
Mcu.IP7=SYS
ProjectManager.CoupleFile=true
PB4.Locked=true
RCC.SYSCLKFreq_VALUE=32000000
RTC.Hours=1
PB5.Signal=GPIO_Output
Mcu.Pin22=VP_SYS_VS_Systick
Mcu.Pin23=VP_TIM2_VS_ClockSourceINT
PA1.Locked=true
Mcu.Pin20=VP_RTC_VS_RTC_Activate
Mcu.Pin21=VP_RTC_VS_RTC_Calendar
PA10.Locked=true
NVIC.ForceEnableDMAVector=false
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
PB2.GPIO_Label=PROX_INT
RTC.HourFormat=RTC_HOURFORMAT_12
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_PuPd
Mcu.Pin15=PB4
ADC.HighThreshold=2048
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB5
Mcu.Pin13=PA9
Mcu.Pin14=PA10
Mcu.Pin19=PB9
ADC.WatchdogChannel=ADC_CHANNEL_1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB6
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB8
PA5.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
Mcu.Pin11=PC9
Mcu.Pin12=PA8
PB8.Mode=I2C
Mcu.Pin10=PC8
NVIC.DMA1_Channel2_3_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PA2.Mode=Asynchronous
PB8.Signal=I2C1_SCL
RCC.PWRFreq_Value=32000000
PC8.Locked=true
RCC.48RNGFreq_Value=32000000
Dma.USART1_RX.1.Direction=DMA_PERIPH_TO_MEMORY
PC9.Signal=GPIO_Output
NVIC.DMA1_Channel1_IRQn=true\:3\:0\:true\:false\:true\:true\:true
ADC.ITMode=ENABLE
PB6.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
RCC.APB1Freq_Value=32000000
PB0.Signal=ADC_IN8
ADC.ContinuousConvMode=ENABLE
PA7.GPIOParameters=GPIO_Speed
NVIC.ADC1_COMP_IRQn=true\:2\:0\:true\:false\:true\:true\:true
ProjectManager.DeviceId=STM32L053R8Tx
ProjectManager.LibraryCopy=1
PA7.Signal=SPI1_MOSI
isbadioc=false
